{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "input_dtype": "float32", "batch_input_shape": [null, 10, 128], "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_6", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "relu", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "normal", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": null, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 7}}]}